Repository: ErversonSousa/jclic
Catalog: i18n/fromLaunchpad/po/jclic-activities/listactivities_*.po
Languages: ru

source: Complex association|In this activity there are also two sets of information, but these may have a different number of parts and there may be different types of relation between them e.g.: one-to-one, various to one, parts without a relation, etc.
ru: Сложные ассоциации|В этом задании также есть два набора информации, но эти могут иметь разное количество частей, а также могут иметь разный тип связи (один к одному, много к одному, лишняя часть и т.д.).

source: Simple association|There are two sets of information that have the same number of parts. Each part from the original set corresponds to one, and only one, part of the image set.
ru: Простые ассоциации|Есть два набора информации с одинаковым количеством частей. Каждая часть из оригинального набора соответствует одной части из набора изображений.

source: Finding pairs|Each of the pieces appear twice, but face down. In each go two pieces are turned over and are turned back over if they are not the same. The objective is to find all the pairs.
ru: Нахождение пар|Каждый из кусков появляется дважды, но верх ногами. При каждой попытке два куска переворачиваются и, если они не одинаковы, переворачиваются назад. Нужно найти все пары

source: Explore activity|An initial piece of information is shown and, upon clicking on it, a given piece of information is shown for each element.
ru: Исследование активности| Начальная часть информации показана и при нажатии на неё, данная часть информации будет показана для каждого элемента.

source: Identify cells|There is just one set of information and you have to click on those parts that meet a certain condition.
ru: Идентифкация ячейки|Существует только один набор информации, и вы должны нажать на те части, которые соответствуют некоторыму условию.

source: Information screen|One set of information is shown and there is the option of activating the multimedia content for each piece of information.
ru: Экран информации| Показана часть информации, также существует возможность активации мультимедиа контента для каждой части информации.

source: Double puzzle|Two grids are shown. One contains the disordered information and the other is empty. The object has to be rearranged in the empty grid by dragging the pieces one by one.
ru: Двойная головоломка|Показаны поля.Одно из них содержит неупорядоченную информацию, другое пусто. Объект должен быть перемещен в пустое поле перемещением частей одна за другой.

source: Exchange puzzle|The information is swapped within the same panel. In each go two pieces swap position until the object is reordered.
ru: Головоломка с замещением| Информация изменилась в пределах одной панели. Каждая из частей поменяет позицию, пока не будет переупорядочена.

source: Hole puzzle|In the same panel one piece is missing and the others are shuffled. In each go one of the pieces next to the empty space is moved until they are back in the original order.
ru: Головоломка с пустотами | В той же самой панели одна часть отсутствует , а другие переставлены. Каждая из них продолжается после пробела и передвинута, пока они не вернутся в первоначальный порядок.

source: Written answer|A set of information is shown and the corresponding text for each of its parts must be written.
ru: Письменный ответ | набор информации показан и соответствующий текст для каждой из его частей должен быть написан.

source: Text: Fill-in blanks|The user has to complete certain words, letters and phrases that have been hidden or camouflaged in a text. The solution of each of the elements may be set up in different ways: writing in a blank space; correcting a phrase that contains errors; or selecting from a list of various possible answers.
ru: Текст: восполнить пробелы| Пользователь должен завершить определенные слова, буквы и фразы, которые были скрыты или замаскированы в тексте. Решение для каждого из элементов может быть установлено по-разному: запись в пробеле; исправление фразы, которая содержит ошибки; или выбор из списка различных возможных ответов.

source: Text: Identify elements|The user has to point out some words, letters, numbers, symbols or punctuation marks with a click of the mouse.
ru: Текст: Определение элементов | пользователь должен указать на некоторые слова, буквы, цифры, символы и знаки препинания с щелчком мыши.

source: Text: Order elements|When designing this activity some of the words or paragraphs of a text are selected to be shuffled around. The user has to put them back in order.
ru: Текст: Упорядочьте элементы | При выполнении этого действия некоторые из слов или абзацы текста выбраны, чтобы быть перемешанными вокруг. Пользователь должен отложить их в порядке.

source: Text: Complete text|Various parts of a text (letters, words, punctuation signs, or phrases) are taken out and the user has to complete it.
ru: Текст: Полный текст | Различные части текста (буквы, слова, знаки препинания, или фразы) стираются, и пользователь должен завершить ее.

source: Crosswords|The word table has to be completed according to its definitions. The definitions may be text, graphics or sound. The programme automatically shows the definitions of the two words which cross in the cursor position.
ru: Пересечение слов | Таблица слов должна быть завершена согласно ее определениям. Определения могут быть текстом, графикой или звуком. Программа автоматически показывает определения двух слов, которые пересекаются в позиции курсора.

source: Word search|The hidden words have to be found in a grid of letters. The neutral cells in the grid (those with no word) are completed with characters chosen at random.
ru: Поиск слова| Скрытые слова должны быть найдены в поле букв. Пустые поля (без слов) заполняются случайными знаками.
